# <center> <u> JOINING & MERGING

In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

#### create 2 dictionaries for building a dataframe

In [2]:
names = pd.DataFrame({
    'id':[1,2,3,4,5],
    'name':['Suhaina','Reshma','Reshma A C','Aiswarya','Doniya'],
})

ages = pd.DataFrame({
    'id':[1,2,3,4,5],
    'age':[32,22,26,23,22],
})

##### here in both the dataframe, id column is repetative. so that we can merge the two different dataframe

In [3]:
df = pd.merge(names,ages, on='id')
df.set_index('id',inplace=True)

In [4]:
df

          name  age
id
1      Suhaina   32
2       Reshma   22
3   Reshma A C   26
4     Aiswarya   23
5       Doniya   22

### <u> JOINS

<table align="center">
<tr>
<th>JOIN MERGE TYPES</th>

    
<table align="center">
<tr>
<th>JOIN</th>
<th>DESCRIPTION</th>
</tr>
<tr>
<td>Left</td>
<td>Uses all keys from left object and merges with right</td>
</tr>
<tr>
<td>Right</td>
<td>Uses all keys from right object and merges with left</td>
</tr>
<tr>
<td>Outer</td>
<td>Uses all keys from both the object and merges them</td>
</tr>   
<tr>
<td>Inner</td>
<td>Uses only the keys which both the object have 
    and merges them(default)</td>
</tr>       
</table>

##### Change our dataframe a littlebit

In [5]:
names = pd.DataFrame({
    'id':[1,2,3,4,5,6],
    'name':['Suhaina','Reshma','Reshma A C','Aiswarya','Doniya','Aswathi'],
})

ages = pd.DataFrame({
    'id':[1,2,3,4,5,7],
    'age':[32,22,26,23,22,23],
})

#### <u> 1. Left Join

In [6]:
df = pd.merge(names,ages, on='id', how='left')
df.set_index('id',inplace=True)

In [7]:
df

          name   age
id
1      Suhaina  32.0
2       Reshma  22.0
3   Reshma A C  26.0
4     Aiswarya  23.0
5       Doniya  22.0
6      Aswathi   NaN

#### <u> 2. Right Join

In [8]:
df = pd.merge(names,ages, on='id', how='right')
df.set_index('id',inplace=True)

In [9]:
df

          name  age
id
1      Suhaina   32
2       Reshma   22
3   Reshma A C   26
4     Aiswarya   23
5       Doniya   22
7          NaN   23

#### <u> 3. Inner Join

In [10]:
df = pd.merge(names,ages, on='id', how='inner')
df.set_index('id',inplace=True)

In [11]:
df

          name  age
id
1      Suhaina   32
2       Reshma   22
3   Reshma A C   26
4     Aiswarya   23
5       Doniya   22

#### <u> 4. Outer Join

In [12]:
df = pd.merge(names,ages, on='id', how='outer')
df.set_index('id',inplace=True)

In [13]:
df

          name   age
id
1      Suhaina  32.0
2       Reshma  22.0
3   Reshma A C  26.0
4     Aiswarya  23.0
5       Doniya  22.0
6      Aswathi   NaN
7          NaN  23.0